#Работу выполнили: Лысенко М. 80%, Ячин Д. 40%

from random import randint

class China:

    def __init__(self, money = 250, food = 200, sat = 450, war = 250, prod = 300):
        self.money = money
        self.food = food
        self.sat = sat
        self.war = war
        self.prod = prod

    def parad(self):
        self.sat += 50

    def inv(self):
        self.war += 50
        self.money -= 50

    def rice(self):
        self.food += 50
        self.sat -= 50

    def breakt(self):
        self.prod += 50
        self.money -= 50

    def sale(self):
        self.money += 50
        self.food -= 50

    def stats_c(self):
        print('Юань: ',self.money)
        print('Рис: ',self.food)
        print('Социальный рейтинг: ',self.sat)
        print('Военный сила партии: ',self.war)
        print('Рукоделие: ',self.prod)
    

class America:

    def __init__(self, money = 450, food = 250, sat = 300, war = 200, prod = 250):
        self.money = money
        self.food = food
        self.sat = sat
        self.war = war
        self.prod = prod

    def printer(self):
        self.money += 50

    def taxes(self):
        self.food += 50
        self.sat -= 50

    def talk(self):
        self.sat += 50
        self.money -= 50

    def guns(self):
        self.war += 50
        self.food -= 50

    def oil(self):
        self.prod += 50
        self.money -=50

    def stats_a(self):
        print('Dollars: ',self.money)
        print('Burgers: ',self.food)
        print('Respect: ',self.sat)
        print('Guns: ',self.war)
        print('Manufacturing: ',self.prod)

class Russia:

    def __init__(self, money = 250, food = 300, sat = 250, war = 450, prod = 200):
        self.money = money
        self.food = food
        self.sat = sat
        self.war = war
        self.prod = prod

    def mob(self):
        self.war += 50

    def line(self):
        self.sat += 50
        self.money -= 50

    def dom(self):
        self.food += 50
        self.prod -= 50

    def res(self):
        self.money += 50
        self.sat -= 50

    def stan(self):
        self.prod += 50
        self.money -= 50

    def stats_r(self):
        print('Рубли: ',self.money)
        print('Пельмени: ',self.food)
        print('Вера в правительство: ',self.sat)
        print('Военная мощь: ',self.war)
        print('Производство: ',self.prod)

china = China()
usa = America()
rus = Russia()

players = dict()

print('Игрок 1, введите НАЗВАНИЕ страны, лидером которой Вы станете: ')
print()
print('1. Китай')
print('2. США')
print('3. Россия')
print()

def choosing(n):

    choice = input()
    if choice.lower() == 'китай' and 'Китай' not in players:
        players['Китай'] = n
        print()
        print('Поздравлять, Вы выбрать Китай! Удар!')
        print('------------------------------------------------------------')
    elif choice.lower() == 'сша' and 'США' not in players:
        players['США'] = n
        print()
        print('Ваш выбор - США. Make America great again!')
        print('------------------------------------------------------------')
    elif choice.lower() == 'россия' and 'Россия' not in players:
        players['Россия'] = n
        print()
        print('Чики-брики и в дамки, вы выбрали Россию.')
        print('------------------------------------------------------------') 
    else:
        print('Похоже, Вы допустили ошибку при вводе названия страны или ее уже выбрал кто-то другой.')
        return choosing(n)

choosing('1')

print('Игрок 2, введите НАЗВАНИЕ страны, лидером которой Вы станете: ')
print()
if 'Китай' in players:
    print('1. США')
    print('2. Россия')
elif 'США' in players:
    print('1. Китай')
    print('2. Россия')
elif 'Россия' in players:
    print('1. Китай')
    print('2. США')

choosing('2')

if 'Китай' not in players:
    print()
    print('Игрок 3, Вы - лидер Китай. Удар!')
    print('------------------------------------------------------------')
    players['Китай'] = '3'
elif 'США' not in players:
    print()
    print('Игрок 3, вы - лидер США. Make America great again!')
    print('------------------------------------------------------------')
    players['США'] = '3'
elif 'Россия' not in players:
    print()
    print('Игрок 3, вы - лидер России. Чики-брики и в дамки!')
    print('------------------------------------------------------------')
    players['Россия'] = '3'

print('=================================================================================================')
print()
print('СПРАВКА')
print('-------------------------------------------------------------------------------------------------')
print()
print('Китай - могучая социалистическая держава. Главный атрибут этой страны - социальный рейтинг.')
print('Китай выигрывает, набрав 1000 очков социального рейтинга.')
print('Сильная сторона: набор очков внутренней политикой.')
print('Слабая сторона: войны')
print()
print('-------------------------------------------------------------------------------------------------')
print()
print('США - сердце капитализма. Главный атрибут страны - деньги.')
print('США выиграет, если наберет 1000 денежных единиц.')
print('Сильная сторона: набор очков сотрудничеством с другими странами.')
print('Слабая сторона: внутренняя политика.')
print()
print('-------------------------------------------------------------------------------------------------')
print()
print('Россия - воинственная страна. Главный атрибут - военная мощь.')
print('Россия одерживает победу, когда набирает 1000 очков военной мощи.')
print('Сильная сторона: войны.')
print('Слабая сторона: сотрудничество с другими странами.')
print()
print('=================================================================================================')

def main_no_a():
    print('Игрок ',players['Китай'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    china.stats_c()
    print()
    print('Выберите, что делать дальше.')
    print()
    china_act_no_a()
    if china.sat >= 1000:
        print('Китай построить коммунизм. Компартия Китай стать величайший орган власти в мире. Весь мир перешел на путь коммунизма.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['Китай'])
        exit()
    if china.money <= 0:
        print('Китай обанкротился. Партия Красный Дракон потеряла всякое влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
        
    elif china.food <= 0:
        print('Жители Китая страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.sat <= 0:
        print('Жители Китая потеряли веру в коммунизм. В стране началась волна восстаний. Тайвань получил независимость.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.war <= 0:
        print('Китай потерял способность обороняться от всяческих атак и стал уязвим.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.prod <= 0:
        print('Китай остался без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()

    print('Игрок ',players['Россия'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    rus.stats_r()
    print()
    print('Выберите, что делать дальше.')
    print()
    rus_act_no_a()
    if rus.war >= 1000:
        print('Военная мощь России возрасла настолько, что ей стало по силам держать в страхе весь мир. Судьба всех стран зависит от воли ее правителя.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['Россия'])
        exit()
    if rus.money <= 0:
        print('Россия обанкротилась и потеряла всякое влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.food <= 0:
        print('Жители России страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.sat <= 0:
        print('Жители России потеряли веру в правительство. В стране началась волна восстаний.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.war <= 0:
        print('Россия потеряла способность обороняться от всяческих атак и стала уязвима.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.prod <= 0:
        print('Россия осталась без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    

    return main_no_a()


def main_no_c():
    print('Игрок ',players['США'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    usa.stats_a()
    print()
    print('Выберите, что делать дальше.')
    print()
    usa_act_no_c()   
    if usa.money >= 1000:
        print('США накопила достаточно денег, чтобы достичь мирового господства. Все страны склонились перед мощью капитализма.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['США'])
        exit()
    if usa.money <= 0:
        print('США обанкротились и потеряли влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.food <= 0:
        print('Жители США страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.sat <= 0:
        print('Жители США потеряли веру в капитализм. В стране началась волна восстаний.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.war <= 0:
        print('США потеряли способность обороняться от всяческих атак и стали уязвимы.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.prod <= 0:
        print('США остались без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')

    print('Игрок ',players['Россия'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    rus.stats_r()
    print()
    print('Выберите, что делать дальше.')
    print()
    rus_act_no_c()
    if rus.war >= 1000:
        print('Военная мощь России возрасла настолько, что ей стало по силам держать в страхе весь мир. Судьба всех стран зависит от воли ее правителя.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['Россия'])
        exit()
    if rus.money <= 0:
        print('Россия обанкротилась и потеряла всякое влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.food <= 0:
        print('Жители России страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.sat <= 0:
        print('Жители России потеряли веру в правительство. В стране началась волна восстаний.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.war <= 0:
        print('Россия потеряла способность обороняться от всяческих атак и стала уязвима.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif rus.prod <= 0:
        print('Россия осталась без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    

    return main_no_c()
    
def main_no_r():
    print('Игрок ',players['США'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    usa.stats_a()
    print()
    print('Выберите, что делать дальше.')
    print()
    usa_act_no_r()   
    if usa.money >= 1000:
        print('США накопила достаточно денег, чтобы достичь мирового господства. Все страны склонились перед мощью капитализма.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['США'])
        exit()
    if usa.money <= 0:
        print('США обанкротились и потеряли влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.food <= 0:
        print('Жители США страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.sat <= 0:
        print('Жители США потеряли веру в капитализм. В стране началась волна восстаний.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.war <= 0:
        print('США потеряли способность обороняться от всяческих атак и стали уязвимы.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
    elif usa.prod <= 0:
        print('США остались без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')

    print('Игрок ',players['Китай'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    china.stats_c()
    print()
    print('Выберите, что делать дальше.')
    print()
    china_act_no_r()
    if china.sat >= 1000:
        print('Китай построить коммунизм. Компартия Китай стать величайший орган власти в мире. Весь мир перешел на путь коммунизма.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['Китай'])
        exit()
    if china.money <= 0:
        print('Китай обанкротился. Партия Красный Дракон потеряла всякое влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
        
    elif china.food <= 0:
        print('Жители Китая страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.sat <= 0:
        print('Жители Китая потеряли веру в коммунизм. В стране началась волна восстаний. Тайвань получил независимость.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.war <= 0:
        print('Китай потерял способность обороняться от всяческих атак и стал уязвим.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.prod <= 0:
        print('Китай остался без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()


    

    return main_no_r()


def main():


    print('Игрок ',players['Китай'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    china.stats_c()
    print()
    print('Выберите, что делать дальше.')
    print()
    china_act()
    if china.sat >= 1000:
        print('Китай построить коммунизм. Компартия Китай стать величайший орган власти в мире. Весь мир перешел на путь коммунизма.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['Китай'])
        exit()
    if china.money <= 0:
        print('Китай обанкротился. Партия Красный Дракон потеряла всякое влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
        
    elif china.food <= 0:
        print('Жители Китая страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.sat <= 0:
        print('Жители Китая потеряли веру в коммунизм. В стране началась волна восстаний. Тайвань получил независимость.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.war <= 0:
        print('Китай потерял способность обороняться от всяческих атак и стал уязвим.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    elif china.prod <= 0:
        print('Китай остался без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Китай'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_c()
    print('Игрок ',players['США'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    usa.stats_a()
    print()
    print('Выберите, что делать дальше.')
    print()
    usa_act()   
    if usa.money >= 1000:
        print('США накопила достаточно денег, чтобы достичь мирового господства. Все страны склонились перед мощью капитализма.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['США'])
        exit()
    if usa.money <= 0:
        print('США обанкротились и потеряли влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_a()
    elif usa.food <= 0:
        print('Жители США страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_a()
    elif usa.sat <= 0:
        print('Жители США потеряли веру в капитализм. В стране началась волна восстаний.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_a()
    elif usa.war <= 0:
        print('США потеряли способность обороняться от всяческих атак и стали уязвимы.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_a()
    elif usa.prod <= 0:
        print('США остались без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['США'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_a()

    print('Игрок ',players['Россия'],', Ваш ход.')
    print()
    print('Ваши показатели:')
    print()
    rus.stats_r()
    print()
    print('Выберите, что делать дальше.')
    print()
    rus_act()
    if rus.war >= 1000:
        print('Военная мощь России возрасла настолько, что ей стало по силам держать в страхе весь мир. Судьба всех стран зависит от воли ее правителя.')
        print()
        print('======================================================================================')
        print()
        print('ИГРА ОКОНЧЕНА. ПОБЕДИТЕЛЬ - ИГРОК',players['Россия'])
        exit()
    if rus.money <= 0:
        print('Россия обанкротилась и потеряла всякое влияние на мировой сцене.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_r()
    elif rus.food <= 0:
        print('Жители России страдают от жесткой нехватки продовольствия.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_r()
    elif rus.sat <= 0:
        print('Жители России потеряли веру в правительство. В стране началась волна восстаний.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_r()
    elif rus.war <= 0:
        print('Россия потеряла способность обороняться от всяческих атак и стала уязвима.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_r()
    elif rus.prod <= 0:
        print('Россия осталась без ресурсов.')
        print()
        print('======================================================================================')
        print()
        print('ИГРОК',players['Россия'],'ДЛЯ ВАС ИГРА ОКОНЧЕНА.')
        print()
        print('======================================================================================')
        main_no_r()
    

    return main()

def usa_act_no_r():
    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Напечатать деньги (+50 dollars)')
        print('2. Уменьшить таможенную пошлину на импорт продуктов питания (+50 burgers, -50 respect)')
        print('3. Выступить с речью (+50 respect, -50 dollars)')
        print('4. Увеличить производство оружия (+50 guns, -50 burgers)')
        print('5. Найти новую нефтяную скважину (+50 manufacturing, -50 dollars)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            usa.printer()
        elif k == '2':
            usa.taxes()
        elif k == '3':
            usa.talk()
        elif k == '4':
            usa.guns()
        elif k == '5':
            usa.oil()
        elif k == '6':
            return usa_act_no_r()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return usa_act_no_r()
        print('------------------------------------------------------------')
    elif k == '2':
            usa_act_c()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        usa_act_no_r()          


def usa_act_no_c():

    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Напечатать деньги (+50 dollars)')
        print('2. Уменьшить таможенную пошлину на импорт продуктов питания (+50 burgers, -50 respect)')
        print('3. Выступить с речью (+50 respect, -50 dollars)')
        print('4. Увеличить производство оружия (+50 guns, -50 burgers)')
        print('5. Найти новую нефтяную скважину (+50 manufacturing, -50 dollars)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            usa.printer()
        elif k == '2':
            usa.taxes()
        elif k == '3':
            usa.talk()
        elif k == '4':
            usa.guns()
        elif k == '5':
            usa.oil()
        elif k == '6':
            return usa_act_no_c()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return usa_act_no_c()
        print('------------------------------------------------------------')
    elif k == '2':
            usa_act_r()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        usa_act_no_c()          
        
def china_act_no_a():
    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Провести парад площадь Шанхай ( +50 социальный рейтинг )')
        print('2. Инвестировать в оружие (+50 военный сила партии, -50 юань)')
        print('3. Отправить народ на поля (+50 рис, -50 социальный рейтинг)')
        print('4. Сделать научное открытие(+50 рукоделие, -50 юань)')
        print('5. Распродажа на AliExpress (+50 юань, -50 рис)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            china.parad()
        elif k == '2':
            china.inv()
        elif k == '3':
            china.rice()
        elif k == '4':
            china.breakt()
        elif k == '5':
            china.sale()
        elif k == '6':
            return china_act_no_a()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return china_act_no_a()
        print('------------------------------------------------------------')
    elif k == '2':
        china_act_r()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        china_act_no_a()

def china_act_no_r():
    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Провести парад площадь Шанхай ( +50 социальный рейтинг )')
        print('2. Инвестировать в оружие (+50 военный сила партии, -50 юань)')
        print('3. Отправить народ на поля (+50 рис, -50 социальный рейтинг)')
        print('4. Сделать научное открытие(+50 рукоделие, -50 юань)')
        print('5. Распродажа на AliExpress (+50 юань, -50 рис)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            china.parad()
        elif k == '2':
            china.inv()
        elif k == '3':
            china.rice()
        elif k == '4':
            china.breakt()
        elif k == '5':
            china.sale()
        elif k == '6':
            return china_act_no_r()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return china_act_no_r()
        print('------------------------------------------------------------')
    elif k == '2':
        china_act_r()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        china_act_no_r()

    
    

def china_act_a():
    print('------------------------------------------------------------')
    print('Выберите направленность ваших действий.')
    print()
    print('1. Сотрудничество.')
    print('2. Вражда.')
    print()
    t = input()
    if t == '1':
        print('------------------------------------------------------------')
        print('1. Продать рис ( +50 юань, -50 рис)')
        print('2. Открыть филиал McDonald’s (+50 рис, -50 юань)')
        print('3. Сотрудничать с Eeeeeelon Маска (+50 рукоделие, -50 социальный рейтинг)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            c_sell_a()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            c_open_a()
        elif r == '3':
            print('------------------------------------------------------------')
            print()
            c_elon_a()
        else:
            print('------------------------------------------------------------')
            print()
            print('Ошибка при вводе номера действия.')
            return china_act()
    elif t == '2':
        print('------------------------------------------------------------')
        print('1. Сделать плагиат смартфон 苹果手机 (+50 социальный рейтинг, -100 юань)')
        print('2. Напасть на Бургер Страна (-50 военный сила партии, -100 социальный рейтинг, -50 рис)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            c_plag_a()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            print('Вы уверены, что хотите развязать войну с Америкой? (Да/Нет)')
            print()
            print('В случае победы вы получите: ',2*china.war,'юань, 200 социальный рейтинг.')
            print('В случае поражения вы потеряете: 100 социальный рейтинг, 100 юань.')
            print()
            sure = input()
            print()
            if sure.lower() == 'да':
                c_war_a()
            elif sure.lower() == 'нет':
                print()
                print('Возврат к списку действий')
                print()
                print('------------------------------------------------------------')
                china_act()
            else:
                print()
                print('Такого варианта ответа нет. Возврат к списку действий.')
                print()
                print('------------------------------------------------------------')
                china_act()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            china_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        china_act()

def china_act_r():
    print('------------------------------------------------------------')
    print('Выберите направленность ваших действий.')
    print()
    print('1. Сотрудничество.')
    print('2. Вражда.')
    print()
    t = input()
    if t == '1':
        print('------------------------------------------------------------')
        print('1. Помочь с изобретением робота Алеши (+50 юань, -50 рукоделие)')
        print('2. Купить лес России (+50 рукоделие, -50 юань)')
        print('3. Попросить посмотреть на разработки оружия (+50 военный сила партии, -50 юань)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            c_alyosha_r()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            c_les_r()
        elif r == '3':
            print('------------------------------------------------------------')
            print()
            c_guns_r()
        else:
            print('------------------------------------------------------------')
            print()
            print('Ошибка при вводе номера действия.')
            return china_act()
    elif t == '2':
        print('------------------------------------------------------------')
        print('1. Пообещать каждому рабочему Ивану город Тверь по кошка жене (+50 юань, -50 социальный рейтинг)')
        print('2. Напасть на Россию (-50 военный сила партии, -100 социальный рейтинг, -50 рис)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            c_cat_r()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            print('Вы уверены, что хотите развязать войну с Россией? (Да/Нет)')
            print()
            print('В случае победы вы получите: ',2*china.war,'юань, 200 социальный рейтинг.')
            print('В случае поражения вы потеряете: 100 социальный рейтинг, 100 юань.')
            print()
            sure = input()
            print()
            if sure.lower() == 'да':
                c_war_r()
            elif sure.lower() == 'нет':
                print()
                print('Возврат к списку действий')
                print()
                print('------------------------------------------------------------')
                china_act()
            else:
                print()
                print('Такого варианта ответа нет. Возврат к списку действий.')
                print()
                print('------------------------------------------------------------')
                china_act()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            china_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        china_act()          
     

def china_act():
    
    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Провести парад площадь Шанхай ( +50 социальный рейтинг )')
        print('2. Инвестировать в оружие (+50 военный сила партии, -50 юань)')
        print('3. Отправить народ на поля (+50 рис, -50 социальный рейтинг)')
        print('4. Сделать научное открытие(+50 рукоделие, -50 юань)')
        print('5. Распродажа на AliExpress (+50 юань, -50 рис)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            china.parad()
        elif k == '2':
            china.inv()
        elif k == '3':
            china.rice()
        elif k == '4':
            china.breakt()
        elif k == '5':
            china.sale()
        elif k == '6':
            return china_act()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return china_act()
        print('------------------------------------------------------------')
    elif k == '2':
        print('------------------------------------------------------------')
        print('Выберите страну, с которой хотите взаимодействовать.')
        print()
        print('1. Америка')
        print('2. Россия')
        print()
        u = input()

        if u == '1':
            china_act_a()
        elif u == '2':
            china_act_r()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            china_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        china_act()             
                    

def usa_act_c():
    print('------------------------------------------------------------')
    print('Выберите направленность ваших действий.')
    print()
    print('1. Сотрудничество.')
    print('2. Вражда.')
    print()
    t = input()
    if t == '1':
        print('------------------------------------------------------------')
        print('1. Купить процессоры для iPhone (+50 manufacturing, -50 dollars)')
        print('2. Купить акции Али-Баба (+50 respect, -50 dollars)')
        print('3. Продать нефть Китаю (+50 dollars, -50 burgers)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            a_phone_c()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            a_ali_c()
        elif r == '3':
            print('------------------------------------------------------------')
            print()
            a_neft_c()
        else:
            print('------------------------------------------------------------')
            print()
            print('Ошибка при вводе номера действия.')
            return usa_act()
    elif t == '2':
        print('------------------------------------------------------------')
        print('1. Сделать монтаж про события на площади ТяньАньМэнь (+50 respect, -100 dollars)')
        print('2. Напасть на Китай (-200 dollars, -100 respect)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            a_ploshad_c()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            print('Вы уверены, что хотите развязать войну с Китаем? (Да/Нет)')
            print()
            print('В случае победы вы получите: ',china.money,'dollars')
            print('В случае поражения вы потеряете: 100 burgers, 200 dollars.')
            print()
            sure = input()
            print()
            if sure.lower() == 'да':
                a_war_c()
            elif sure.lower() == 'нет':
                print()
                print('Возврат к списку действий')
                print()
                print('------------------------------------------------------------')
                usa_act()
            else:
                print()
                print('Такого варианта ответа нет. Возврат к списку действий.')
                print()
                print('------------------------------------------------------------')
                usa_act()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            usa_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        usa_act()
                    
                    
def usa_act_r():
    print('------------------------------------------------------------')
    print('Выберите направленность ваших действий.')
    print()
    print('1. Сотрудничество.')
    print('2. Вражда.')
    print()
    t = input()
    if t == '1':
        print('------------------------------------------------------------')
        print('1. Купить газ (+50 manufacturing, -50 dollars)')
        print('2. Продать партию iPhone 15 (+50 dollars, -50 respect)')
        print('3. Купить партию ВАЗ-2115 (+50 guns, -50 dollars)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            a_gaz_r()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            a_phone_r()
        elif r == '3':
            print('------------------------------------------------------------')
            print()
            a_vaz_r()
        else:
            print('------------------------------------------------------------')
            print()
            print('Ошибка при вводе номера действия.')
            return usa_act()
    elif t == '2':
        print('------------------------------------------------------------')
        print('1. Наложить санкции (+50 respect, -100 dollars)')
        print('2. Напасть на Россию (-200 dollars, -100 respect)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            a_sanct_r()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            print('Вы уверены, что хотите развязать войну с Россией? (Да/Нет)')
            print()
            print('В случае победы вы получите: ',rus.money,'dollars')
            print('В случае поражения вы потеряете: 100 burgers, 200 dollars.')
            print()
            sure = input()
            print()
            if sure.lower() == 'да':
                a_war_r()
            elif sure.lower() == 'нет':
                print()
                print('Возврат к списку действий')
                print()
                print('------------------------------------------------------------')
                usa_act()
            else:
                print()
                print('Такого варианта ответа нет. Возврат к списку действий.')
                print()
                print('------------------------------------------------------------')
                usa_act()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            usa_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        usa_act()          
                 
                        

def usa_act():

    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Напечатать деньги (+50 dollars)')
        print('2. Уменьшить таможенную пошлину на импорт продуктов питания (+50 burgers, -50 respect)')
        print('3. Выступить с речью (+50 respect, -50 dollars)')
        print('4. Увеличить производство оружия (+50 guns, -50 burgers)')
        print('5. Найти новую нефтяную скважину (+50 manufacturing, -50 dollars)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            usa.printer()
        elif k == '2':
            usa.taxes()
        elif k == '3':
            usa.talk()
        elif k == '4':
            usa.guns()
        elif k == '5':
            usa.oil()
        elif k == '6':
            return usa_act()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return usa_act()
        print('------------------------------------------------------------')
    elif k == '2':
        print('------------------------------------------------------------')
        print('Выберите страну, с которой хотите взаимодействовать.')
        print()
        print('1. Китай')
        print('2. Россия')
        print()
        u = input()

        if u == '1':
            usa_act_c()
        elif u == '2':
            usa_act_r()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            usa_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        usa_act()          

def rus_act_no_a():
    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Устроить мобилизацию (+50 военная мощь)')
        print('2. Провести прямую линию (+50 вера в правительство, -50 деревянных)')
        print('3. Увеличить инвестиции в домашние хозяйства (+50 пельмени, -50 производство)')
        print('4. Продать ресурсы Сибири (+50 деревянные, -50 вера в правительство)')
        print('5. Закупить станки (+50 производство, -50 деревянных)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            rus.mob()
        elif k == '2':
            rus.line()
        elif k == '3':
            rus.dom()
        elif k == '4':
            rus.res()
        elif k == '5':
            rus.stan()
        elif k == '6':
            return rus_act_no_a()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return rus_act_no_a()
        print('------------------------------------------------------------')
    elif k == '2':
        print('------------------------------------------------------------')
        rus_act_c()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        rus_act_no_a() 


def rus_act_no_c():
    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Устроить мобилизацию (+50 военная мощь)')
        print('2. Провести прямую линию (+50 вера в правительство, -50 деревянных)')
        print('3. Увеличить инвестиции в домашние хозяйства (+50 пельмени, -50 производство)')
        print('4. Продать ресурсы Сибири (+50 деревянные, -50 вера в правительство)')
        print('5. Закупить станки (+50 производство, -50 деревянных)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            rus.mob()
        elif k == '2':
            rus.line()
        elif k == '3':
            rus.dom()
        elif k == '4':
            rus.res()
        elif k == '5':
            rus.stan()
        elif k == '6':
            return rus_act_no_c()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return rus_act_no_c()
        print('------------------------------------------------------------')
    elif k == '2':
        print('------------------------------------------------------------')
        rus_act_a()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        rus_act_no_c()          




def rus_act_c():
    print('------------------------------------------------------------')
    print('Выберите направленность ваших действий.')
    print()
    print('1. Сотрудничество.')
    print('2. Вражда.')
    print()
    t = input()
    if t == '1':
        print('------------------------------------------------------------')
        print('1. Продать лес (-50 производство, +50 рублей)')
        print('2. Купить новую разработку (-50 рублей, +50 военная мощь)')
        print('3. Поделиться архивными секретами социализма (+50 рублей, -50 доверие к власти)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            r_les_c()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            r_razrab_c()
        elif r == '3':
            print('------------------------------------------------------------')
            print()
            r_soc_c()
        else:
            print('------------------------------------------------------------')
            print()
            print('Ошибка при вводе номера действия.')
            return rus_act()
    elif t == '2':
        print('------------------------------------------------------------')
        print('1. Показать по телевизору ядерное оружие (+50 военная мощь, -100 доверие к власти)')
        print('2. Напасть на Китай ( -200 военная мощь, -50 производство, -50 пельмени)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            r_show_c()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            print('Вы уверены, что хотите развязать войну с Китаем? (Да/Нет)')
            print()
            print('В случае победы вы получите: 300 военная мощь и 150 производство')
            print('В случае поражения вы потеряете: 50 военная мощь и 150 рублей')
            print()
            sure = input()
            print()
            if sure.lower() == 'да':
                r_war_c()
            elif sure.lower() == 'нет':
                print()
                print('Возврат к списку действий')
                print()
                print('------------------------------------------------------------')
                rus_act()
            else:
                print()
                print('Такого варианта ответа нет. Возврат к списку действий.')
                print()
                print('------------------------------------------------------------')
                rus_act()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            rus_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        rus_act()

def rus_act_a():
    print('------------------------------------------------------------')
    print('Выберите направленность ваших действий.')
    print()
    print('1. Сотрудничество.')
    print('2. Вражда.')
    print()
    t = input()
    if t == '1':
        print('------------------------------------------------------------')
        print('1. Продать партию Спутника-V  (+50 рублей, -50 доверие к власти) ')
        print('2. Купить транспорт (+50 военная мощь, -50 рублей)')
        print('3. Попросить увеличить количество Грин-карт (+50 доверие к власти, -50 рублей)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            r_sputnik_a()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            r_transport_a()
        elif r == '3':
            print('------------------------------------------------------------')
            print()
            r_green_a()
        else:
            print('------------------------------------------------------------')
            print()
            print('Ошибка при вводе номера действия.')
            return rus_act()
    elif t == '2':
        print('------------------------------------------------------------')
        print('1. Показать по телевизору ядерное оружие (+50 военная мощь, -100 доверие к власти)')
        print('2. Напасть на Америку(-200 военная мощь, -50 производство, -50 пельмени)')
        print()
        r = input()
        if r == '1':
            print('------------------------------------------------------------')
            print()
            r_show_c()
        elif r == '2':
            print('------------------------------------------------------------')
            print()
            print('Вы уверены, что хотите развязать войну с Америкой? (Да/Нет)')
            print()
            print('В случае победы вы получите: 300 военная мощь и 150 производство.')
            print('В случае поражения вы потеряете: 50 военная мощь и 150 рублей.')
            print()
            sure = input()
            print()
            if sure.lower() == 'да':
                r_war_a()
            elif sure.lower() == 'нет':
                print()
                print('Возврат к списку действий')
                print()
                print('------------------------------------------------------------')
                rus_act()
            else:
                print()
                print('Такого варианта ответа нет. Возврат к списку действий.')
                print()
                print('------------------------------------------------------------')
                rus_act()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            rus_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        rus_act()             


def rus_act():

    print('1. Внутренняя политика')
    print('2. Внешняя политика')
    print('------------------------------------------------------------')

    k = input()
    if k == '1':
        print('------------------------------------------------------------')
        print('1. Устроить мобилизацию (+50 военная мощь)')
        print('2. Провести прямую линию (+50 вера в правительство, -50 деревянных)')
        print('3. Увеличить инвестиции в домашние хозяйства (+50 пельмени, -50 производство)')
        print('4. Продать ресурсы Сибири (+50 деревянные, -50 вера в правительство)')
        print('5. Закупить станки (+50 производство, -50 деревянных)')
        print('6. Назад.')
        print('------------------------------------------------------------')
        print()
        k = input()

        if k == '1':
            rus.mob()
        elif k == '2':
            rus.line()
        elif k == '3':
            rus.dom()
        elif k == '4':
            rus.res()
        elif k == '5':
            rus.stan()
        elif k == '6':
            return rus_act()
        else:
            print('Кажется, вы допустили ошибку при выборе действия.')
            return rus_act()
        print('------------------------------------------------------------')
    elif k == '2':
        print('------------------------------------------------------------')
        print('Выберите страну, с которой хотите взаимодействовать.')
        print()
        print('1. Китай')
        print('2. США')
        print()
        u = input()

        if u == '1':
            rus_act_c()
        elif u == '2':
            rus_act_a()
        else:
            print()
            print('Такого варианта ответа нет. Возврат к списку действий.')
            print()
            print('------------------------------------------------------------')
            rus_act()
    else:
        print()
        print('Такого варианта ответа нет. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        rus_act()          

 
def c_sell_a():
    print('Игрок',players['США'],'лидер Китая хочет продать вам рис. Вы получите 50 burgers, но потеряете 50 dollars. Вы согласны? (Да/Нет)')
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        print()
        print('Обмен произведен')
        print()
        print('------------------------------------------------------------')
        china.money+=50
        china.food-=50
        usa.food+=50
        usa.money-=50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Америка отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        china_act()
    else:
        print('Ответ указан некорректно.')
        return c_sell_a()

def c_open_a():
    print("Игрок",players['США'],"лидер Китая хочет открыть у себя филиал McDonald's. Вы получите 50 dollars, но потеряете 50 burgers. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        china.food += 50
        china.money -= 50
        usa.food -= 50
        usa.money += 50
        print()
        print('Обмен произведен')
        print()
        print('------------------------------------------------------------')
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Америка отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        china_act()
    else:
        print('Ответ указан некорректно.')
        return c_open_a()

def c_elon_a():
    print("Игрок",players['США'],"лидер Китая хочет сотрудничать с Илоном Маском. Вы получите 50 dollars, но потеряете 50 manufacturing. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        china.prod += 50
        china.sat -= 50
        usa.money += 50
        usa.prod -= 50
        print()
        print('Обмен произведен')
        print()
        print('------------------------------------------------------------')
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Америка отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        china_act()
    else:
        print('Ответ указан некорректно.')
        return c_elon_a()    

def c_plag_a():
    print('Ваша партия выпустить новый модель Xiaomi')
    print()
    print('Америка потеряла 50 долларов')
    print()
    print('------------------------------------------------------------')
    print()    
    china.money += 50
    china.prod -= 100
    usa.money-=50

def c_war_a():
    china.war -= 50
    china.sat -= 100
    china.food -= 50
    success = randint(1,2)
    if success == 1:
        china.money += 2*china.war
        china.sat+=200
        print()
        print('------------------------------------------------------------')
        print('Китай одержал победу в войне с Америкой.')
        print()
        print('Потери Америки: 100 burgers, 200 dollars.')
        print()
        print('------------------------------------------------------------')
        usa.food -= 100
        usa.money -= 200
    else:
        china.sat -= 100
        china.money -= 100
        print()
        print('------------------------------------------------------------')
        print('Китай проиграл в войне с Америкой.')
        print('Америка получила ',china.money,'dollars.')
        print()
        print('------------------------------------------------------------')
        usa.money+=china.money

def c_alyosha_r():
    print('Игрок',players['Россия'],'лидер Китая хочет помочь вам с разработкой робота Алеши. Вы получите 50 доверия к власти, но потеряете 50 рублей. Вы согласны? (Да/Нет)')
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        china.money += 50
        china.prod -= 50
        rus.sat += 50
        rus.money -= 50
        print()
        print('Обмен произведен')
        print()
        print('------------------------------------------------------------')
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Россия отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        china_act()
    else:
        print('Ответ указан некорректно.')
        return c_alyosha_r()

        
def c_les_r():
    print('Игрок',players['Россия'],'лидер Китая хочет купить у вас лес. Вы получите 50 рублей, но потеряете 50 производства. Вы согласны? (Да/Нет)')
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        china.money-=50
        china.prod+=50
        rus.money+=50
        rus.prod-=50
        print()
        print('Обмен произведен')
        print()
        print('------------------------------------------------------------')
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Россия отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        china_act()
    else:
        print('Ответ указан некорректно.')
        return c_les_r()

def c_guns_r():
    print('Игрок',players['Россия'],'лидер Китая хочет посмотреть на разработки вашего оружия. Вы получите 50 рублей, но потеряете 50 доверия к власти. Вы согласны? (Да/Нет)')
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        china.war+=50
        china.money-=50
        rus.money+=50
        rus.sat-=50
        print()
        print('Обмен произведен')
        print()
        print('------------------------------------------------------------')
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Россия отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        china_act()
    else:
        print('Ответ указан некорректно.')
        return c_guns_r()

def c_cat_r():
    print('Ваша партия пообещать житель Россия скорый кошка жена за взнос в экономика партия Красный Дракон')
    print()
    print('Россия потеряла 50 рублей')
    print()
    print('------------------------------------------------------------')
    print()    
    china.money += 50
    china.sat -= 100
    rus.money -= 50

def c_war_r():
    china.war -= 50
    china.sat -= 100
    china.food -= 50
    success = randint(1,3)
    if success == 1:
        china.money += 2*china.war
        china.sat+=200
        print()
        print('------------------------------------------------------------')
        print('Китай одержал победу в войне с Россией.')
        print()
        print('Потери России: 50 военная мощь, 150 рублей.')
        print()
        print('------------------------------------------------------------')
        rus.war -= 50
        usa.money -= 150
    elif success == 2 or success == 3:
        china.sat -= 100
        china.money -= 100
        print()
        print('------------------------------------------------------------')
        print('Китай проиграл в войне с Россией.')
        print('Россия получила 100 военной мощи и 100 производства.')
        print()
        print('------------------------------------------------------------')
        rus.war += 100
        rus.prod += 100

def a_phone_c():
    print("Игрок",players['Китай'],"лидер Америки хочет купить у вас процессоры для телефонов. Вы получите 50 юань, но потеряете 50 военная сила партии. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        usa.prod+=50
        usa.money-=50
        china.money+=50
        china.war-=50
        print()
        print('Обмен произведен')
        print()
        print('------------------------------------------------------------')
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Китай отказался производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        usa_act()
    else:
        print('Ответ указан некорректно.')
        return a_phone_c()

def a_ali_c():
    print("Игрок",players['Китай'],"лидер Америки хочет купить у вас акции Али-Баба. Вы получите 50 юань, но потеряете 50 социальный рейтинг. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        usa.sat += 50
        usa.money -= 50
        china.money+=50
        china.sat-=50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Китай отказался производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        usa_act()
    else:
        print('Ответ указан некорректно.')
        return a_ali_c()

def a_neft_c():
    print("Игрок",players['Китай'],"лидер Америки хочет продать вам нефть. Вы получите 50 рукоделие, но потеряете 50 юань. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        usa.money += 50
        usa.food -= 50
        china.prod += 50
        china.money -= 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Китай отказался производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        usa_act()
    else:
        print('Ответ указан некорректно.')
        return a_neft_c()    

def a_ploshad_c():
    print('Вы делаете монтаж, заверяющий жителей Китая, что на площади ТяньАньМэнь что-то происходить.')
    print()
    print('Китай потерял 50 социального рейтинга.')
    print()
    print('------------------------------------------------------------')
    print()    
    usa.sat+=50
    usa.money-=100
    china.sat-=50

def a_war_c():
    usa.money -= 200
    usa.sat -= 100
    success = randint(1,2)
    if success == 1:
        usa.money += china.money
        print()
        print('------------------------------------------------------------')
        print('Америка одержала победу в войне с Китаем.')
        print()
        print('Потери Китая: 100 социальный рейтинг, 100 юань.')
        print()
        print('------------------------------------------------------------')
        china.sat -= 100
        china.money -= 100
    else:
        usa.food -= 100
        usa.money -= 100
        print()
        print('------------------------------------------------------------')
        print('Америка проиграла в войне с Китаем.')
        print('Китай получил ',2*china.war,'юань.')
        print()
        print('------------------------------------------------------------')
        china.money+=2*china.war

def a_gaz_r():
    print("Игрок",players['Россия'],"лидер Америки хочет купить у Вас газ. Вы получите 50 рублей, но потеряете 50 производства. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        usa.prod += 50
        usa.money -= 50
        rus.money += 50
        rus.prod -= 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Россия отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        usa_act()
    else:
        print('Ответ указан некорректно.')
        return a_gaz_r()

def a_phone_r():
    print("Игрок",players['Россия'],"лидер Америки хочет продать вам партию iPhone. Вы получите 50 доверия к власти, но потеряете 50 рублей. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        usa.sat -= 50
        usa.money += 50
        rus.sat += 50
        rus.money -= 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Россия отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        usa_act()
    else:
        print('Ответ указан некорректно.')
        return a_phone_r()

def a_vaz_r():
    print("Игрок",players['Россия'],"лидер Америки хочет купить у вас партию ВАЗ-2115. Вы получите 50 рублей, но потеряете 50 доверия к власти. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        usa.war += 50
        usa.money -= 50
        rus.sat -= 50
        rus.money += 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Россия отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        usa_act()
    else:
        print('Ответ указан некорректно.')
        return a_phone_r()

def a_sanct_r():
    print('Вы накладываете санкции на Россию.')
    print()
    print('Россия потеряла 50 военной мощи.')
    print()
    print('------------------------------------------------------------')
    print()    
    usa.sat+=50
    usa.money-=100
    rus.war-=50

def a_war_r():
    usa.money -= 200
    usa.sat -= 100
    success = randint(1,2)
    if success == 1:
        usa.money += rus.money
        print()
        print('------------------------------------------------------------')
        print('Америка одержала победу в войне с Россией.')
        print()
        print('Потери России: 100 военная мощь, 150 рублей.')
        print()
        print('------------------------------------------------------------')
        rus.war -= 100
        rus.money -= 150
    else:
        usa.food -= 100
        usa.money -= 100
        print()
        print('------------------------------------------------------------')
        print('Америка проиграла в войне с Россией.')
        print('Россия получила 100 военной мощи и 100 производства.')
        print()
        print('------------------------------------------------------------')
        rus.war+=100
        rus.prod+=100

def r_les_c():
    print("Игрок",players['Китай'],"лидер России хочет продать вам лес. Вы получите 50 рукоделие, но потеряете 50 юань. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        rus.prod -= 50
        rus.money += 50
        china.prod += 50
        china.money -= 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Китай отказался производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        rus_act()
    else:
        print('Ответ указан некорректно.')
        return r_les_c()

def r_razrab_c():
    print("Игрок",players['Китай'],"лидер России хочет купить у вас новую разработку. Вы получите 50 юань, но потеряете 50 социальный рейтинг. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        rus.war += 50
        rus.money -= 50
        china.sat -= 50
        china.money += 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Китай отказался производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        rus_act()
    else:
        print('Ответ указан некорректно.')
        return r_razrab_c()

def r_soc_c():
    print("Игрок",players['Китай'],"лидер России хочет продать вам архивные секреты социализма. Вы получите 50 социальный рейтинг, но потеряете 50 юань. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        rus.sat -= 50
        rus.money += 50
        china.sat += 50
        china.money -= 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Китай отказался производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        rus_act()
    else:
        print('Ответ указан некорректно.')
        return r_soc_c()

def r_show_c():
    print('Вы показываете свое ядерное оружие по телевизору.')
    print()
    print('Китай и Америка потеряли по 50 доверия к власти.')
    print()
    print('------------------------------------------------------------')
    print()    
    usa.sat-=50
    rus.sat-=100
    rus.war+=50
    china.sat-=50

def r_war_c():
    rus.war -= 200
    rus.prod -= 50
    rus.food -= 50
    success = randint(1,3)
    if success == 1 or success == 2:
        rus.war += 300
        rus.prod += 150
        print()
        print('------------------------------------------------------------')
        print('Россия одержала победу в войне с Китаем.')
        print()
        print('Потери Китая: 100 социальный рейтинг, 100 юань.')
        print()
        print('------------------------------------------------------------')
        china.sat -= 100
        china.money -= 100
    elif success == 3:
        rus.war -= 50
        rus.money -= 150
        print()
        print('------------------------------------------------------------')
        print('Россия проиграла в войне с Китаем.')
        print('Китай получил ',2*china.war,'юань.')
        print()
        print('------------------------------------------------------------')
        china.money+=2*china.war

def r_sputnik_a():
    print("Игрок",players['Америка'],"лидер России хочет продать вам партию Спутника-V. Вы получите 50 respect, но потеряете 50 dollars. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        rus.sat -= 50
        rus.money += 50
        usa.sat += 50
        usa.money -= 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Америка отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        rus_act()
    else:
        print('Ответ указан некорректно.')
        return r_sputnik_a()

def r_transport_a():
    print("Игрок",players['Америка'],"лидер России хочет купить у вас партию транспорта. Вы получите 50 dollars, но потеряете 50 respect. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        rus.war += 50
        rus.money -= 50
        usa.sat -= 50
        usa.money += 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Америка отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        rus_act()
    else:
        print('Ответ указан некорректно.')
        return r_transport_a()

def r_green_a():
    print("Игрок",players['Америка'],"лидер России просит вас увеличить количество Грин-карт. Вы получите 50 dollars, но потеряете 50 respect. Вы согласны? (Да/Нет)")
    print()
    print('------------------------------------------------------------')
    response = input()
    if response.lower() == 'да':
        rus.sat += 50
        rus.money -= 50
        usa.sat -= 50
        usa.money += 50
    elif response.lower() == 'нет':
        print('------------------------------------------------------------')
        print('Америка отказалась производить обмен. Возврат к списку действий.')
        print()
        print('------------------------------------------------------------')
        print()
        rus_act()
    else:
        print('Ответ указан некорректно.')
        return r_green_a()

def r_war_a():
    rus.war -= 200
    rus.prod -= 50
    rus.food -= 50
    success = randint(1,3)
    if success == 1 or success == 2:
        rus.war += 300
        rus.prod += 150
        print()
        print('------------------------------------------------------------')
        print('Россия одержала победу в войне с США.')
        print()
        print('Потери Америки: 100 burgers, 200 dollars.')
        print()
        print('------------------------------------------------------------')
        usa.food -= 100
        usa.money -= 200
    elif success == 3:
        rus.war -= 50
        rus.money -= 150
        print()
        print('------------------------------------------------------------')
        print('Россия проиграла в войне с США.')
        print('Америка получила ',rus.money,'dollars.')
        print()
        print('------------------------------------------------------------')
        usa.money+=rus.money


main()
